# -*- coding: utf-8 -*-
"""HW_lvl_4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1_zTPpVrpOy1jPHitxalBt4ypV6OAN4GG
"""

# Задача 4.1.
# Домашнее задание на SQL

# В базе данных teacher создайте таблицу Students

# Структура таблицы: Student_Id - Integer, Student_Name - Text, School_Id - Integer (Primary key)

# Наполните таблицу следующими данными:

# 201, Иван, 1
# 202, Петр, 2
# 203, Анастасия, 3
# 204, Игорь, 4

# Напишите программу, с помощью которой по ID студента можно получать информацию о школе и студенте.

# Формат вывода:

# ID Студента:
# Имя студента:
# ID школы:
# Название школы:

import sqlite3

connection = sqlite3.connect('teachers.db') 
cursor = connection.cursor()
sqlquery = """INSERT INTO Students (Student_Id, Student_Name, School_Id) 
VALUES
(201, 'Иван', 1),
(202, 'Петр', 2),
(203, 'Анастасия', 3),
(204, 'Игорь', 4);"""

cursor.execute(sqlquery)
connection.commit()
connection.close()

import sqlite3

connection = sqlite3.connect('teachers.db') 
cursor = connection.cursor()

cursor.execute('SELECT * FROM Students')
columnname = cursor.description
connection.close()
for col in columnname:
  print(col[0])

import sqlite3

def get_student(Student_Id):
  try:
    connection = sqlite3.connect('teachers.db')
    cursor = connection.cursor()
    sqlquery = """SELECT * FROM School JOIN Students ON School.School_Id = Students.School_Id WHERE Student_Id = ?"""
    cursor.execute(sqlquery,(Student_Id,))
    records = cursor.fetchall()
    for row in records:
      print('ID Студента: ', row[3])
      print('Имя студента: ', row[4])
      print('ID школы: ', row[0])
      print('Название школы: ', row[1])

    connection.close()

  except(Exception, sqlite3.Error) as error:
    print('Ошибка в получении данных ', error)

get_student(204)